# Улучшение HomeWork3. Task1. Задайте список из нескольких чисел. 
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# было
# list = [2, 3, 5, 9, 3] 
# print(list) 
# sum = 0
# for i in range(len(list)):
#      if i %  2 != 0:
#          sum = sum + list[i]
# print(f'Сумма элементов, находящихся на нечётной позиции = {sum}' )

# стало
list = [2, 3, 5, 9, 3] 
new_list = [x for i, x in enumerate(list) if i % 2 != 0] 
print(f'Элементы на нечетных позициях {new_list}, а их сумма равна {sum(new_list)}')