# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)


number = int(input("Введите число: "))
sum = 1
per = 1
while per <= number:
 sum = sum * per
 per = per + 1
 print(sum)