# Задайте последовательность чисел. Напишите программу, 
# которая выведет список неповторяющихся элементов исходной последовательности.


list = [11, 11, 22, 33, 44, 44, 11, 55, 88, 88, 77]

print(tuple(filter(lambda num: list.count(num) == 1, list)))